Tekla.Structures.Model.GridPlane.Insert
Inserts the grid plane into the model.
Returns: True on success.

Tekla.Structures.Model.GridPlane.Select
Selects the grid plane with the given ID.
Returns: True on success.

Tekla.Structures.Model.GridPlane.Delete
Deletes the grid plane with the given ID.
Returns: True on success.

Tekla.Structures.Model.GridPlane.Label
The label for the grid plane.

Tekla.Structures.Model.GridPlane.IsMagnetic
Whether the grid plane is magnetic or not.

Tekla.Structures.Model.GridPlane.DrawingVisibility
The visibility of the grid plane in drawings.